# <font color='blue'>**Librería Pandas - Parte 2**</font>

In [2]:
import numpy as np
import pandas as pd

# <font color='blue'>**Edición de Series**</font>

Podemos modificar un valor de una serie usando la notación corchetes, y haciendo referencia a índices o a las etiquetas.

In [3]:
s = pd.Series([1, 2, 3, 4, 5], index = ["a", "b", "c", "d", "e"])
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
s[0] = -1
s["b"] = -2
s

a   -1
b   -2
c    3
d    4
e    5
dtype: int64

Podemos asignar un valor a un rango, definido por índices o por etiquetas, asignando el valor a cada uno de los elementos involucrados en el rango.

In [5]:
s[1:3] = 0
s

a   -1
b    0
c    0
d    4
e    5
dtype: int64

In [6]:
s["b":"d"]
s

a   -1
b    0
c    0
d    4
e    5
dtype: int64

Si el rango está delimitado por números (haciendo referencia a la posición de los elementos), el último elemento del rango no se incluye. Por el contrario, si está delimitado por etiquetas, el último elemento sí se incluye.

Al rango podemos asignar también una lista de valores, aunque en este caso la lista deberá tener el mismo número de elementos que el rango en cuestión.

In [7]:
s[1:3] = [0, 1]
s

a   -1
b    0
c    1
d    4
e    5
dtype: int64

In [8]:
s["b":"d"] = [10, 11, 12]
s

a    -1
b    10
c    11
d    12
e     5
dtype: int64

Si asignamos un valor haciendo referencia a una etiqueta que no existe en el índice, se añade dicha etiqueta al índice y se le asigna el valor.

In [9]:
s["f"] = 0
s

a    -1
b    10
c    11
d    12
e     5
f     0
dtype: int64

Esto solo funciona con etiquetas. Si utilizamos un índice y éste no existe en la serie, se devolverá un error.

Si usamos un rango con etiquetas y alguna de las etiquetas no existe, solo se asigna el valor a las existentes.

In [10]:
s["f":"h"] = 0
s

a    -1
b    10
c    11
d    12
e     5
f     0
dtype: int64

Por último, también podemos usar en la selección una lista -tanto de índices como de etiquetas-, en cuyo caso se seleccionan los valores indicados en el orden indicado. Por ejemplo, podemos usar la lista ["c", "a"] para asignar a los elementos correspondientes los valores 1 y 2, respectivamente.

In [11]:
s[["c", "a"]] = [1, 2]
s

a     2
b    10
c     1
d    12
e     5
f     0
dtype: int64

In [12]:
s[[1, 0]] = [20, 21]
s

a    21
b    20
c     1
d    12
e     5
f     0
dtype: int64

## <font color='blue'>**Eliminación de elementos en una Serie**</font>

El método **pandas.Series.drop** devuelve una copia de la serie tras eliminar el elemento cuya etiqueta se especifica como argumento.

In [13]:
s = pd.Series([1, 2, 3, 4, 5], index = ["a", "b", "c", "d", "e"])
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [16]:
r = s.drop("b")
r

a    1
c    3
d    4
e    5
dtype: int64

En este ejemplo se ha pasado como único argumento la etiqueta del elemento a eliminar, y el método ha devuelto la serie sin dicho elemento. Si la etiqueta no se encontrase en la serie, se devolvería un error.

También se puede pasar como argumento no una etiqueta, sino una lista de etiquetas. En este caso se eliminarán todos los elementos con dichas etiquetas.

In [14]:
r = s.drop(["d", "a"])
r

b    2
c    3
e    5
dtype: int64

Las etiquetas no tienen que estar en orden.

El argumento **inplace = True** realiza la eliminación inplace (modificando directamente la serie).

Este método exige el uso de etiquetas para seleccionar los elementos a eliminar. Esto significa que si en un momento dado necesitamos eliminar uno o más elementos por su índice, deberemos convertirlos en sus correspondientes etiquetas, lo que resulta extremadamente sencillo seleccionando los elementos adecuados del index.

In [17]:
s = pd.Series([1, 2, 3, 4, 5], index = ["a", "b", "c", "d", "e"])
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

Si se desea eliminar los elementos cuyos índices son 1 y 3, basta utilizar el atributo *index* para que devuelve todas las etiquetas.

In [20]:
s.index[[1, 3]]

s.

1

In [ ]:
s.drop(s.index[[1, 3]])

Otra forma para eliminar un elemento de una serie es el método **pandas.Series.pop**. Al igual que con el método drop, éste solo acepta una etiqueta y devuelve el valor correspondiente a dicha etiqueta, eliminándolo de la serie in-place.

In [ ]:
s = pd.Series([1, 2, 3, 4, 5], index = ["a", "b", "c", "d", "e"])
s.pop("b")
s

Si la etiqueta no se encuentra en el index, el método devolverá un error.

## <font color='blue'>**Método where**</font>

El método **pandas.Series.where** permite filtrar los valores de una serie de forma que solo los que cumplan cierta condición se mantengan. Los valores que no la cumplan son sustituidos por un valor (NaN por defecto).

In [21]:
s = pd.Series(np.arange(0,10))
s

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

Por ejemplo, filtrar los elementos de $s$ que sean pares.

In [22]:
s.where(s % 2 == 0)

0    0.0
1    NaN
2    2.0
3    NaN
4    4.0
5    NaN
6    6.0
7    NaN
8    8.0
9    NaN
dtype: float64

Los valores que no cumplen la condición son sustituidos por NaN. Es posible modificar este valor de reemplazo pasando al método como segundo argumento el valor que se quiere fijar.

In [23]:
s.where(s % 2 == 0, -1)

0    0
1   -1
2    2
3   -1
4    4
5   -1
6    6
7   -1
8    8
9   -1
dtype: int32

# <font color='blue'>**Edición de Dataframes**</font>

Existe una gran variedad de formas para seleccionar elementos o bloques de elementos de un dataframe, y cada una de estas selecciones puede ser utilizada para modificar los valores contenidos en el dataframe.

Podemos modificar un valor concreto usando los métodos **loc** o **iloc**, en función de que queramos usar sus etiquetas o índices.

In [24]:
df = pd.DataFrame(np.arange(12).reshape([4, 3]),
                  index = ["a", "b", "c", "d"],
                  columns = ["A", "B", "C"])
df

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

In [25]:
df.iloc[1, 2] = -1
df

   A   B   C
a  0   1   2
b  3   4  -1
c  6   7   8
d  9  10  11

Es posible modificar una columna completa seleccionándola y asignándole, por ejemplo, una lista con los nuevos valores.

In [26]:
df = pd.DataFrame(np.arange(12).reshape([4, 3]),
                  index = ["a", "b", "c", "d"],
                  columns = ["A", "B", "C"])
df["A"] = [10, 20, 30, 40]
df

    A   B   C
a  10   1   2
b  20   4   5
c  30   7   8
d  40  10  11

En este caso, la longitud de la lista conteniendo los valores a insertar deberá coincidir con la longitud de la columna, salvo que en lugar de una lista se esté asignando un único valor, en cuyo caso se propagará a toda la columna.

Si la selección es un bloque de datos de un tamaño arbitrario, nos encontramos en el mismo escenario: o bien insertamos datos con el mismo tamaño que la selección, o insertamos un único valor que se propagará a toda la selección.

In [27]:
df = pd.DataFrame(np.arange(12).reshape([4, 3]),
                  index = ["a", "b", "c", "d"],
                  columns = ["A", "B", "C"])
df.loc["b":"c", "A":"B"] = [[-1, -2], [-3, -4]]
df

   A   B   C
a  0   1   2
b -1  -2   5
c -3  -4   8
d  9  10  11

In [28]:
df = pd.DataFrame(np.arange(12).reshape([4, 3]),
                  index = ["a", "b", "c", "d"],
                  columns = ["A", "B", "C"])
df.loc["b":"c", "A":"B"] = -1
df

   A   B   C
a  0   1   2
b -1  -1   5
c -1  -1   8
d  9  10  11

También es posible insertar datos en una columna o fila inexistente, en cuyo caso se crea y se le asignan los valores en cuestión.

In [ ]:
df = pd.DataFrame(np.arange(12).reshape([4, 3]),
                  index = ["a", "b", "c", "d"],
                  columns = ["A", "B", "C"])
df["D"] = [10, 20, 30, 40]
df

In [ ]:
df = pd.DataFrame(np.arange(12).reshape([4, 3]),
                  index = ["a", "b", "c", "d"],
                  columns = ["A", "B", "C"])
df.loc["e"] = [10, 20, 30]
df

## <font color='blue'>**Método where**</font>

De forma semejante a las series, el método de los dataframes **where** filtra los valores contenidos en el dataframe de forma que solo los que cumplan cierta condición se mantengan. El resto de valores son sustituidos por un valor que, por defecto, es NaN.

In [18]:
df = pd.DataFrame(np.arange(12).reshape(-1, 3), columns = ["A", "B", "C"])
df

   A   B   C
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

Filtrar los valores múltiplos de 2:

In [19]:
df.where(df % 2 == 0)

     A     B    C
0  0.0   NaN  2.0
1  NaN   4.0  NaN
2  6.0   NaN  8.0
3  NaN  10.0  NaN

Todos aquellos valores que no son múltiplo de 2 son sustituidos por NaN. Si, por ejemplo, quisiéramos cambiar de signo a los valores que no cumplen la condición impuesta, lo haríamos así:

In [20]:
df.where(df % 2 == 0, -df)

   A   B   C
0  0  -1   2
1 -3   4  -5
2  6  -7   8
3 -9  10 -11

## <font color='blue'>**Eliminación de elementos en un dataframe**</font>

El método **pandas.DataFrame.drop** elimina las filas o columnas indicadas y devuelve el resultado, permitiéndose diferentes criterios para especificarlas.

El primer criterio consiste en indicar la lista de etiquetas a eliminar y el eje al que pertenecen.

In [29]:
df = pd.DataFrame(np.arange(16).reshape([4, 4]), 
                  index = ["a", "b", "c", "d"],
                  columns = ["A", "B", "C", "D"])
df

    A   B   C   D
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

Eliminar las filas cuyas etiquetas son "a" y "c".

In [30]:
df.drop(["a", "c"], axis = 0)

    A   B   C   D
b   4   5   6   7
d  12  13  14  15

In [31]:
df.drop(["a", "c"])

    A   B   C   D
b   4   5   6   7
d  12  13  14  15

Obsérvese que lo que se muestra es el resultado de eliminar las filas indicadas del dataframe. Éste no se modifica salvo que utilicemos el argumento **inplace = True**.

Para eliminar columnas, habría que indicar el eje correspondiente.

In [ ]:
df.drop(["B", "D"], axis = 1)

Otra alternativa para especificar si se están eliminando filas o columnas es utilizar directamente los parámetros **index** y **columns**. Así, otra forma de eliminar las filas "a" y "c" sería la siguiente:

In [ ]:
df.drop(index = ["a", "c"])

In [ ]:
df.drop(columns = ["B", "D"])

## <font color='green'>**Ejercicio 1**</font>

En la liga del diplomado de ciencia de datos juegan 6 equipos: Equipo A, Equipo B, Equipo C, Equipo D, Equipo E y el **Equipo de Profes** (Campeón invicto).

La imagen muestra la tabla resumen con los resultados de la liga.

<img src='https://drive.google.com/uc?export=view&id=1xW3fW4RrTim0N6hGjT51QxBOW-e36if8' width="800" align="center" style="margin-right: 20px">

1. Generar el dataframe tabla_posiciones con la información de la tabla anterior.
2. Determinar para cada equipo la diferencia de goles (goles a favor -  goles en contra) y agregar esta información al dataframe.
3. Determinar la posición de cada equipo en la liga y presentar la información ordenada.
4. Durante la confrontación entre el Equipo A y el **Equipo de Profes** que fue ganada por A. El equipo A tenía más jugadores en cancha que los reglamentarios (tramposos!!!), por lo que la comisión disciplinaria decidió: i) descontar los puntos al equipo A y entregarlos (justamente) al **Equipo de Profes**, ii) finalizar el partido por un marcador de 3-0 a favor de los profes. Realice las ediciones correspondientes en el dataframe y entregue la tabla de posiciones final.
5. El premio al fair play se entrega al equipo con mejor comportamiento, para ello, se deben sumar las tarjetas acumuladas (tanto amarillas como rojas) en donde a las tarjetas rojas se les aplica un castigo multiplicándolas por 2, en caso de empate se selecciona al con menor número de tarjetas rojas, si se mantiene el empate el premio es para el equipo con menor número de tarjetas totales. Cree una columna fair play con el indicador descrito y determine el ganador del premio.
6. El último lugar de la tabla desciende de la liga y por lo tanto debe ser eliminado del dataframe.

In [22]:
#Parte 1
dic1 = {'Puntos': [30, 25, 27, 17, 19, 23], 'Goles a favor': [65, 45, 60, 30, 25, 45], 'Goles en contra': [10, 15, 20, 60, 30, 20], 'Tarjetas Amarillas': [7, 2, 4, 4, 9, 4], 'Tarjetas Rojas': [3,2,2,4,5,1]}
indices = ['Equipo A', 'Equipo B', 'Equipo Profes', 'Equipos C','Equipos D', 'Equipo E']

tabla_posiciones = pd.DataFrame(dic1, index = indices)
print(tabla_posiciones)

               Puntos  Goles a favor  Goles en contra  Tarjetas Amarillas  \
Equipo A           30             65               10                   7
Equipo B           25             45               15                   2
Equipo Profes      27             60               20                   4
Equipos C          17             30               60                   4
Equipos D          19             25               30                   9
Equipo E           23             45               20                   4

               Tarjetas Rojas
Equipo A                    3
Equipo B                    2
Equipo Profes               2
Equipos C                   4
Equipos D                   5
Equipo E                    1

In [23]:
tabla_posiciones['Diferencia de goles'] = tabla_posiciones['Goles a favor'] - tabla_posiciones['Goles en contra']
print(tabla_posiciones)

               Puntos  Goles a favor  Goles en contra  Tarjetas Amarillas  \
Equipo A           30             65               10                   7
Equipo B           25             45               15                   2
Equipo Profes      27             60               20                   4
Equipos C          17             30               60                   4
Equipos D          19             25               30                   9
Equipo E           23             45               20                   4

               Tarjetas Rojas  Diferencia de goles
Equipo A                    3                   55
Equipo B                    2                   30
Equipo Profes               2                   40
Equipos C                   4                  -30
Equipos D                   5                   -5
Equipo E                    1                   25

In [24]:
tabla_posiciones.sort_values('Puntos', ascending = False, inplace = True)
tabla_posiciones['Posiciones'] = list(range(1, len(indices) + 1))

In [25]:
# Parte 1
tabla_posiciones.loc['Equipo A', 'Puntos'] -= 3
tabla_posiciones.loc['Equipo Profes', 'Puntos'] += 3

# Parte 2
tabla_posiciones.loc['Equipo Profes', 'Goles a favor'] += 3

In [26]:
# Nueva tabla
tabla_posiciones.sort_values('Puntos', ascending = False, inplace = True)
tabla_posiciones

,Puntos,Goles a favor,Goles en contra,Tarjetas Amarillas,Tarjetas Rojas,Diferencia de goles,Posiciones
Equipo Profes,30,63,20,4,2,40,2
Equipo A,27,65,10,7,3,55,1
Equipo B,25,45,15,2,2,30,3
Equipo E,23,45,20,4,1,25,4
Equipos D,19,25,30,9,5,-5,5
Equipos C,17,30,60,4,4,-30,6

## <font color='green'>**Fin ejercicio 1**</font>

# <font color='blue'>**Unión de series y dataframes**</font>

Muchas veces nos encontramos con que los datos a analizar están repartidos entre dos o más bloques de datos, lo que nos obliga a unirlos, bien concatenándolos, o bien realizando un "join" entre las estructuras (uniones del mismo tipo que las realizadas en bases de datos).

## <font color='blue'>**Unión de series**</font>

## <font color='blue'>**Función concat**</font>

Un caso con el que nos encontramos con relativa frecuencia es aquel en el que queremos unir una serie a otra.

In [32]:
import pandas as pd
s = pd.Series([1, 2, 3, 4, 5], index = ["a", "b", "c", "d", "e"])
r = pd.Series([10, 11, 12], index = ["f", "g", "h"])

Si deseamos unir $r$ y $s$ en una nueva serie, podemos usar la función **pandas.concat**. Esta función permite especificar el eje a lo largo del cual unir los diferentes objetos (pueden ser series o dataframes). Por defecto, la concatenación se realiza a lo largo del eje 0.

In [33]:
t = pd.concat([s, r])
print(type(t))
t

<class 'pandas.core.series.Series'>

a     1
b     2
c     3
d     4
e     5
f    10
g    11
h    12
dtype: int64

El resultado es una serie.

In [34]:
a = pd.Series([1, 2, 3, 4, 5], index = ["a", "b", "c", "d", "e"])
b = pd.Series([10, 11, 12], index = ["a", "b", "f"])
print(a)
print( )
print(b)

a    1
b    2
c    3
d    4
e    5
dtype: int64

a    10
b    11
f    12
dtype: int64

Si especificamos como eje de concatenación el eje 1, pandas alineará los valores con idénticas etiquetas. En el siguiente ejemplo, las series $a$ y $b$ tienen algunas etiquetas comunes (y otras no). El resultado incluye todas las etiquetas asignando el valor NaN ("Not a Number") a aquellos valores desconocidos.

In [35]:
pd.concat([a,b], axis = 1)

     0     1
a  1.0  10.0
b  2.0  11.0
c  3.0   NaN
d  4.0   NaN
e  5.0   NaN
f  NaN  12.0

In [ ]:
type(pd.concat([a,b], axis = 1))

Como puede observarse, el resultado es un dataframe.

Por otro lado, las etiquetas del índice no tienen por qué ser diferentes, de forma que si se estuviesen concatenando series con etiquetas comunes en sus índices, el resultado sería equivalente a los vistos hasta ahora.

In [36]:
s = pd.Series([1, 2, 3, 4], index = ["a", "b", "c", "d"])
r = pd.Series([10, 11, 12], index = ["a", "c", "e"])
print(a)
print( )
print(b)

a    1
b    2
c    3
d    4
e    5
dtype: int64

a    10
b    11
f    12
dtype: int64

In [37]:
pd.concat([s, r])

a     1
b     2
c     3
d     4
a    10
c    11
e    12
dtype: int64

En este ejemplo se han concatenado dos series que tienen dos etiquetas comunes ("a" y "c"), y se puede observar que las dos apariciones de cada una de ellas se incluyen en el resultado de la concatenación.

## <font color='blue'>**Método append**</font>

Otra alternativa es usar el método **pandas.Series.append**, versión simplificada de la función concat ya vista que devuelve la unión de la serie sobre la que se aplica con otra (u otras) series, pero solo a lo largo del eje 0.

In [38]:
a = pd.Series([1, 2, 3, 4, 5], index = ["a", "b", "c", "d", "e"])
b = pd.Series([10, 11, 12], index = ["f", "g", "h"])
print(a)
print( )
print(b)

a    1
b    2
c    3
d    4
e    5
dtype: int64

f    10
g    11
h    12
dtype: int64

In [39]:
c = a.append(b)
c

a     1
b     2
c     3
d     4
e     5
f    10
g    11
h    12
dtype: int64

Si el argumento **ignore_index** toma el valor True, se ignoran las etiquetas de las series.

In [40]:
c = a.append(b, ignore_index = True)
c

0     1
1     2
2     3
3     4
4     5
5    10
6    11
7    12
dtype: int64

## <font color='blue'>**Concatenación y unión de dataframes**</font>

Ésta es otra de las áreas en las que la variedad de opciones puede resultar confusa. A modo de resumen, digamos que pandas ofrece dos principales funciones con este objetivo: **pandas.concat** y **pandas.merge**.

* La función **concat** permite concatenar dataframes a lo largo de un determinado eje
* La función **merge** permite realizar uniones (joins) entre dataframes tal y como se realizan en bases de datos. Esta función también está disponible como método: **pandas.DataFrame.merge**

Hay una tercera función que está disponible solo como método: **pandas.DataFrame.append**. El método **append** ofrece una funcionalidad semejante a la de la función concat pero reducida. Así, por ejemplo, solo permite realizar concatenaciones a lo largo del eje 0 (es decir, verticalmente).

## <font color='blue'>**Función concat**</font>

La función **pandas.concat** es la responsable de concatenar dos o más dataframes (y de todas las estructuras proveídas por pandas) a lo largo de un eje, con soporte a lógica de conjuntos a la hora de gestionar etiquetas en ejes no coincidentes.

In [41]:
df1 = pd.DataFrame(np.arange(9).reshape([3, 3]),
                   index = ["a", "b", "d"],
                   columns = ["A", "B", "C"])
df1

   A  B  C
a  0  1  2
b  3  4  5
d  6  7  8

In [42]:
df2 = pd.DataFrame(np.arange(12).reshape([4, 3]),
                   index = ["a", "b", "c", "e"],
                   columns = ["B", "C", "D"])
df2

   B   C   D
a  0   1   2
b  3   4   5
c  6   7   8
e  9  10  11

Si pasamos a la función concat ambos dataframes como primer argumento (en forma de lista), obtenemos el siguiente resultado:

In [43]:
pd.concat([df1, df2])

     A  B   C     D
a  0.0  1   2   NaN
b  3.0  4   5   NaN
d  6.0  7   8   NaN
a  NaN  0   1   2.0
b  NaN  3   4   5.0
c  NaN  6   7   8.0
e  NaN  9  10  11.0

Por defecto, la concatenación se ha realizado a lo largo del eje 0 (eje vertical), uniendo los índices de fila de ambos dataframes, y alineando las columnas por su etiqueta. Los valores para los que no hay datos se han rellenado con NaN.

Si especificamos que la concatenación se realice a lo largo del eje 1 (eje horizontal), el resultado es el siguiente:

In [44]:
pd.concat([df1, df2], axis = 1)

     A    B    C    B     C     D
a  0.0  1.0  2.0  0.0   1.0   2.0
b  3.0  4.0  5.0  3.0   4.0   5.0
d  6.0  7.0  8.0  NaN   NaN   NaN
c  NaN  NaN  NaN  6.0   7.0   8.0
e  NaN  NaN  NaN  9.0  10.0  11.0

De modo semejante al primer ejemplo, se han introducido NaN's donde no había datos, y se han alineado las filas por su etiqueta.

Estos dos ejemplos vistos son tipo **"Outer"** (opción por defecto), considerando todas las etiquetas de los dos dataframes aun cuando no sean comunes a ambos. Pero si especificamos el argumento **join = "Inner"**, los resultados pasan a considerar solo las etiquetas comunes.

In [45]:
pd.concat([df1, df2], join = "inner")

   B   C
a  1   2
b  4   5
d  7   8
a  0   1
b  3   4
c  6   7
e  9  10

Incluye solo las columnas B y C comunes a ambos dataframes. Y para el segundo ejemplo tenemos:

In [46]:
pd.concat([df1, df2], axis = 1, join = "inner")

   A  B  C  B  C  D
a  0  1  2  0  1  2
b  3  4  5  3  4  5

Incluyendo solo las filas a y b comunes a ambos dataframes.

El parámetro **ignore_index** controla el índice a asignar al eje a lo largo del cuál se realiza la concatenación. Si este parámetro toma el valor False (por defecto), el eje de concatenación mantiene las etiquetas de los dataframes originales. Si toma el valor True, se ignoran dichas etiquetas y el resultado de la concatenación recibe un nuevo índice automático numérico.

In [47]:
pd.concat([df1, df2], axis = 1, join = "inner", ignore_index = True)

   0  1  2  3  4  5
a  0  1  2  0  1  2
b  3  4  5  3  4  5

## <font color='blue'>**Método append**</font>

El método **pandas.DataFrame.append** es un atajo de la función concat que ofrece funcionalidad semejante pero limitada: no permite especificar el eje de concatenación (siempre es el eje 0) ni el tipo de "join" (siempre es tipo "Outer").

In [48]:
df1 = pd.DataFrame(np.arange(9).reshape([3, 3]),
                   index = ["a", "b", "d"],
                   columns = ["A", "B", "C"])
df1

   A  B  C
a  0  1  2
b  3  4  5
d  6  7  8

In [49]:
df2 = pd.DataFrame(np.arange(12).reshape([4, 3]),
                   index = ["a", "b", "c", "e"],
                   columns = ["B", "C", "D"])
df2

   B   C   D
a  0   1   2
b  3   4   5
c  6   7   8
e  9  10  11

In [50]:
df1.append(df2)

     A  B   C     D
a  0.0  1   2   NaN
b  3.0  4   5   NaN
d  6.0  7   8   NaN
a  NaN  0   1   2.0
b  NaN  3   4   5.0
c  NaN  6   7   8.0
e  NaN  9  10  11.0

Al igual que ocurría con la función **concat**, el parámetro ignore_index nos permite controlar las etiquetas que recibe el índice del resultado: las de los dataframes originales (con ignore_index = False, opción por defecto), o uno nuevo automático (con ignore_index = True).

## <font color='blue'>**Función Merge**</font>

La función **pandas.merge** nos permite realizar "joins" entre tablas. El join es realizado sobre las columnas o sobre las filas. En el primer caso, las etiquetas de las filas son ignoradas. En cualquier otro caso (joins realizado entre etiquetas de filas, o entre etiquetas de filas y de columnas), las etiquetas de filas se mantienen.

In [52]:
df1 = pd.DataFrame({
    "Mes": ["ene", "feb", "mar", "may"],
    "Ventas": [14, 8, 12, 17]
})
df1

   Mes  Ventas
0  ene      14
1  feb       8
2  mar      12
3  may      17

In [53]:
df2 = pd.DataFrame({
    "Mes": ["feb", "ene", "mar", "abr"],
    "Costos": [7, 6, 8, 5]
})
df2

   Mes  Costos
0  feb       7
1  ene       6
2  mar       8
3  abr       5

Ambos dataframes tienen una columna común ("Month") y varias filas comunes ("ene", "feb" y "mar"). Obsérvese que en df2 las filas no están ordenadas y que, en df1, el mes de enero tiene índice 0 mientras que, en df2, el mes de enero tiene índice 1.

Si aplicamos la función merge a estos dataframes con los valores por defecto, obtenemos el siguiente resultado.

In [56]:
pd.merge(df1, df2)

   Mes  Ventas  Mes  Costos
0  ene      14  feb       7
1  feb       8  ene       6
2  mar      12  mar       8
3  may      17  abr       5

Esos valores por defecto suponen que el join se realiza sobre las columnas comunes y tipo "inner" (considerando solo las filas con etiquetas comunes).

Si especificamos que el join sea de tipo "outer", lo que definimos con el parámetro how, el resultado considerará todas las etiquetas presentes en ambos dataframes.

In [57]:
pd.merge(df1, df2, how = "outer")

   Mes  Ventas  Costos
0  ene    14.0     6.0
1  feb     8.0     7.0
2  mar    12.0     8.0
3  may    17.0     NaN
4  abr     NaN     5.0

Se rellena con NaN's los valores inexistentes. Otras opciones para el parámetro how son "left" y "right" (además de la opción por defecto, "outer").

Por defecto, el join se realiza entre las columnas comunes. Esto es, sin embargo, controlable usando el parámetro **on** y especificando la columna o columnas a usar.

In [58]:
df1 = pd.DataFrame({
    "Mes": ["ene", "ene", "feb", "feb"],
    "Producto": ["A", "B", "A", "B"],
    "Ventas": [14, 8, 12, 17]
})
df1

   Mes Producto  Ventas
0  ene        A      14
1  ene        B       8
2  feb        A      12
3  feb        B      17

In [59]:
df2 = pd.DataFrame({
    "Mes": ["ene", "ene", "feb", "feb"],
    "Producto": ["A", "B", "A", "B"],
    "Costo": [7, 6, 8, 5]
})
df2

   Mes Producto  Costo
0  ene        A      7
1  ene        B      6
2  feb        A      8
3  feb        B      5

Hay dos columnas comunes, lo que supone que el resultado de un merge por defecto sería el siguiente:

In [60]:
pd.merge(df1, df2)

   Mes Producto  Ventas  Costo
0  ene        A      14      7
1  ene        B       8      6
2  feb        A      12      8
3  feb        B      17      5

Es decir, para cada combinación de Mes-Producto se añadirían los valores de los campos de ventas y costo. Si se quiere que el join se realice solo por uno de los campos, Producto, por ejemplo, bastaría con especificarlo con el parámetro on.

In [61]:
pd.merge(df1, df2, on = "Producto")

  Mes_x Producto  Ventas Mes_y  Costo
0   ene        A      14   ene      7
1   ene        A      14   feb      8
2   feb        A      12   ene      7
3   feb        A      12   feb      8
4   ene        B       8   ene      6
5   ene        B       8   feb      5
6   feb        B      17   ene      6
7   feb        B      17   feb      5

Además del campo utilizado para realizar el join ("Producto"), al existir un campo común a ambos dataframes ("Mes") que no se desea usar para el join, pandas añade un sufijo (configurable) a este campo en ambas tablas para poder diferenciarlo.

También podría ocurrir que ambos dataframes no tuviesen columnas comunes (columnas con el mismo nombre) pero que, aun así, quisiéramos realizar el join por algunas de ellas. Por ejemplo:

In [71]:
df1 = pd.DataFrame({
    "Mes": ["ene", "feb", "mar", "may"],
    "Ventas": [14, 8, 12, 17]
})
df1

   Mes  Ventas
0  ene      14
1  feb       8
2  mar      12
3  may      17

In [72]:
df2 = pd.DataFrame({
    "NombreMes": ["feb", "ene", "mar", "abr"],
    "Costos": [7, 6, 8, 5]
})
df2

  NombreMes  Costos
0       feb       7
1       ene       6
2       mar       8
3       abr       5

Al no haber columnas comunes, la ejecución de la función merge devolvería un error. En este caso podemos usar los parámetros **left_on** y **right_on** para especificar el campo a usar en la tabla de la izquierda del join y en la de la derecha, respectivamente.

In [73]:
pd.merge(df1, df2, left_on = "Mes", right_on = "NombreMes")

   Mes  Ventas NombreMes  Costos
0  ene      14       ene       6
1  feb       8       feb       7
2  mar      12       mar       8

## <font color='blue'>**Join por filas**</font>

Si queremos que el join considere las filas -y no las columnas- de alguno de los dataframes para realizar el join, podemos usar los parámetros **left_index** y **right_index**.

In [74]:
df1 = pd.DataFrame({
    "Mes": ["ene", "feb", "mar", "may"],
    "Ventas": [14, 8, 12, 17]
})
df1

   Mes  Ventas
0  ene      14
1  feb       8
2  mar      12
3  may      17

In [75]:
df2 = pd.DataFrame({
    "Compras": [5, 9, 11, 2, 6]},
    index = ["ene", "feb", "mar", "abr", "may"]
)
df2

     Compras
ene        5
feb        9
mar       11
abr        2
may        6

La ejecución de la función **merge** no sería posible -devolvería un error- pues no hay columnas columnes. En este caso querríamos que para el dataframe df1 se considerase la columna "Mes" -usando el parámetro left_on- y para el dataframe df2 el índice -usando el parámetro right_index-, de la siguiente forma:

In [76]:
pd.merge(df1, df2, left_on = "Mes", right_index = True)

   Mes  Ventas  Compras
0  ene      14        5
1  feb       8        9
2  mar      12       11
3  may      17        6

# <font color='blue'>**Operaciones con estructuras pandas**</font>

Al basarse la bibliteca **pandas** en **NumPy**, todas las funciones universales de esta última funcionan con pandas, pero con una particularidad: al aplicar operaciones unarias se conservan las etiquetas de filas y columnas, y en funciones binarias, se van a alinear las filas y columnas de las estructuras involucradas por sus etiquetas.

## <font color='blue'>**Operaciones con series**</font>

Si aplicamos una función unaria a una serie, el resultado es otra serie que conserva los índices de la original.

In [77]:
r = pd.Series([1, 2, 3, 4], index = ["a", "b", "c", "d"])
r

a    1
b    2
c    3
d    4
dtype: int64

In [78]:
print(type(np.square(r)))
np.square(r)

<class 'pandas.core.series.Series'>

a     1
b     4
c     9
d    16
dtype: int64

Por otro lado, los operadores aritméticos que involucran dos o más series van a alinear las etiquetas antes de ejecutarse.

In [79]:
r = pd.Series([1, 2, 3, 4], index = ["a", "b", "c", "d"])
s = pd.Series([1, 2, 3, 4], index = ["b", "c", "d", "e"])
print(r)
print( )
print(s)

a    1
b    2
c    3
d    4
dtype: int64

b    1
c    2
d    3
e    4
dtype: int64

In [80]:
r + s

a    NaN
b    3.0
c    5.0
d    7.0
e    NaN
dtype: float64

En este ejemplo, se han sumado dos series cuyas etiquetas no son todas comunes. Pandas rellena los valores no coincidentes con NaN.

Si se utiliza el método **pandas.Series.add** se asigna a la serie sobre la que se aplica el método el resultado de la suma.

In [81]:
r = pd.Series([1, 2, 3, 4], index = ["a", "b", "c", "d"])
s = pd.Series([1, 2, 3, 4], index = ["b", "c", "d", "e"])
r.add(s)

a    NaN
b    3.0
c    5.0
d    7.0
e    NaN
dtype: float64

Usando este método es posible especificar el valor a usar para rellenar los elementos desconocidos usando el parámetro **fill_value**.

In [82]:
r = pd.Series([1, 2, 3, 4], index = ["a", "b", "c", "d"])
s = pd.Series([1, 2, 3, 4], index = ["b", "c", "d", "e"])
print(r)
print( )
print(s)

a    1
b    2
c    3
d    4
dtype: int64

b    1
c    2
d    3
e    4
dtype: int64

In [83]:
r.add(s, fill_value = 0)

a    1.0
b    3.0
c    5.0
d    7.0
e    4.0
dtype: float64

Con este atributo, no estamos simplemente sustituyendo los NaN del resultado por el valor indicado, sino que estamos usando dicho valor como alternativa a los valores de las series originales que no existiesen.

Otras funciones son:

* **pandas.Series.sub**, que resta una serie a otra, elemento por elemento
* **pandas.Series.mul**, que multipica una serie por otra, elemento por elemento
* **pandas.Series.div**, que divide una serie por otra, elemento por elemento
* **pandas.Series.round**, que redondea los elementos de una serie al número de decimales indicado.

En la documentación oficial está el listado completo de funciones disponibles para las series, pinche <a href="https://pandas.pydata.org/pandas-docs/stable/reference/series.html">aquí</a>.

## <font color='blue'>**Operaciones con dataframes**</font>

Las operaciones binarias alinearán los datos de los dataframes involucrados según sus etiquetas de filas y columnas antes de ejecutarse.

In [84]:
df1 = pd.DataFrame({"A": [2, 4, 2],
                    "B": [1, 0, 4],
                    "C": [7, 3, 4],
                    "D": [3, 1, 5]},
                   index = ["ene", "feb", "mar"])
df1

     A  B  C  D
ene  2  1  7  3
feb  4  0  3  1
mar  2  4  4  5

In [85]:
df2 = pd.DataFrame({"A": [3, 5, 2],
                    "C": [1, 2, 3],
                    "D": [4, 3, 4],
                    "E": [6, 3, 1]},
                   index = ["feb", "mar", "abr"])
df2

     A  C  D  E
feb  3  1  4  6
mar  5  2  3  3
abr  2  3  4  1

In [86]:
df1 + df2

       A   B    C    D   E
abr  NaN NaN  NaN  NaN NaN
ene  NaN NaN  NaN  NaN NaN
feb  7.0 NaN  4.0  5.0 NaN
mar  7.0 NaN  6.0  8.0 NaN

Pandas inserta NaN's en aquellas combinaciones de etiquetas para las que no hay un valor en ambos dataframes.

La alineación se produce con independencia del orden en el que las etiquetas aparezcan en los índices.

Podemos realizar la misma operación y asignar el resultado a uno de los dataframes con el método **pandas.DataFrame.add**.

In [87]:
df1.add(df2)

       A   B    C    D   E
abr  NaN NaN  NaN  NaN NaN
ene  NaN NaN  NaN  NaN NaN
feb  7.0 NaN  4.0  5.0 NaN
mar  7.0 NaN  6.0  8.0 NaN

Con este método, de forma semejante a como ocurría con las series, es posible establecar un valor predeterminado para aquellos valores que no se encuentren en uno de los dataframes usando el parámetro **fill_value**.

In [88]:
df1.add(df2, fill_value = 0)

       A    B    C    D    E
abr  2.0  NaN  3.0  4.0  1.0
ene  2.0  1.0  7.0  3.0  NaN
feb  7.0  0.0  4.0  5.0  6.0
mar  7.0  4.0  6.0  8.0  3.0

Ahora, el valor correspondiente a A-Abr no es un NaN, sino 2 (valor que podemos encontrar en el dataframe df2). Aquellas combinaciones de etiquetas para las que no existe valor alguno en ninguno de los dos dataframes siguen recibiendo un NaN.

Se muestra a continuación un listado con algunas operaciones básicas disponibles como métodos de dataframes:

* **pandas.DataFrame.add**: suma los dos dataframes, elemento por elemento
* **pandas.DataFrame.sub**: resta a un dataframe otro dataframe, elemento por elemento
* **pandas.DataFrame.mul**: multiplica un dataframe por otro, elemento por elemento
* **pandas.DataFrame.div**: divide un dataframe por otro, elemento por elemento
* **pandas.DataFrame.mod**: devuelve el resultado de calcular el módulo de un dataframe y otro dataframe, elemento por elemento
* **pandas.DataFrame.dot**: devuelve la multiplicación de las dos matrices representadas por los dos dataframes
* **pandas.DataFrame.abs**: devuelve una copia del dataframe conteniendo el valor absoluto de cada uno de sus valores

Podemos encontrar en la documentación oficial de pandas el listado completo de funciones disponibles, pinche <a href="https://pandas.pydata.org/pandas-docs/stable/reference/frame.html">aquí</a>.
.

## <font color='blue'>**Métodos de agregación y estadística**</font>

Los dataframes poseen un útil método que devuelve información estadística sobre los valores contenidos en él: **pandas.DataFrame.describe**:

In [89]:
ventas = pd.DataFrame({
    "Entradas": [41, 32, 56, 18],
    "Salidas": [17, 54, 6, 78],
    "Valoración": [66, 54, 49, 66],
    "Limite": ["No", "Si", "No", "No"],
    "Cambio": [1.43, 1.16, -0.67, 0.77]
},
index = ["ene", "feb", "mar", "abr"]
)
ventas

     Entradas  Salidas  Valoración Limite  Cambio
ene        41       17          66     No    1.43
feb        32       54          54     Si    1.16
mar        56        6          49     No   -0.67
abr        18       78          66     No    0.77

In [90]:
ventas.describe()

        Entradas    Salidas  Valoración    Cambio
count   4.000000   4.000000    4.000000  4.000000
mean   36.750000  38.750000   58.750000  0.672500
std    15.945219  33.260337    8.616844  0.935107
min    18.000000   6.000000   49.000000 -0.670000
25%    28.500000  14.250000   52.750000  0.410000
50%    36.500000  35.500000   60.000000  0.965000
75%    44.750000  60.000000   66.000000  1.227500
max    56.000000  78.000000   66.000000  1.430000

Este método devuelve el número de elementos no nulos por columna, el valor medio, la desviación estándar, el valor mínimo y el máximo, y los valores correspondientes a los percentiles 25, 50 y 75.

In [91]:
df = pd.DataFrame({"A": [3, 5, 2],
                    "B": [1, 2, 3],
                    "C": [4, 3, 4],
                    "D": [6, 3, 1]},
                   index = ["ene", "feb", "mar"])
df

     A  B  C  D
ene  3  1  4  6
feb  5  2  3  3
mar  2  3  4  1

**pandas.DataFrame.mean**, devuelve la media aritmética de los valores del dataframe a lo largo de un determinado eje (eje 0 -vertical- por defecto):

In [92]:
df.mean()

A    3.333333
B    2.000000
C    3.666667
D    3.333333
dtype: float64

In [93]:
df.mean(axis = 1)

ene    3.50
feb    3.25
mar    2.50
dtype: float64

* **pandas.DataFrame.median**: Devuelve la mediana de los valores del dataframe a lo largo de un determinado eje.
* **pandas.DataFrame.mode**: Devuelve la moda de los valores del dataframe a lo largo de un determinado eje.
* **pandas.DataFrame.std**: Devuelve la desviación estándar de los valores del dataframe a lo largo de un determinado eje.
* **pandas.DataFrame.var**: Devuelve la varianza de los valores del dataframe a lo largo de un determinado eje
* **pandas.DataFrame.pct_change**: Devuelve el porcentaje de cambio de un valor con respecto al de la fila anterior (también puede aplicarse a columnas usando el parámetro axis):

In [94]:
df = pd.DataFrame({"A": [3, 5, 2, 4],
                    "B": [1, 2, 3, 3],
                    "C": [4, 3, 4, 6],
                    "D": [6, 3, 1, 3]},
                   index = ["ene", "feb", "mar", "abr"])
df

     A  B  C  D
ene  3  1  4  6
feb  5  2  3  3
mar  2  3  4  1
abr  4  3  6  3

In [95]:
df.pct_change()

            A    B         C         D
ene       NaN  NaN       NaN       NaN
feb  0.666667  1.0 -0.250000 -0.500000
mar -0.600000  0.5  0.333333 -0.666667
abr  1.000000  0.0  0.500000  2.000000

Para los valores de la primera fila, al no existir una anterior con respecto a la que realizar el cálculo, reciben un valor NaN por defecto. En todo caso, es posible regular el comportamiento del método al respecto de los valores NaN con el parámetro **fill_method**.

**pandas.DataFrame.nunique**: Devuelve el número de elementos distintos a lo largo de un determinado eje. El parámetro dropna controla si se incluyen los NaN en el recuento o no.

In [96]:
df.nunique()

A    4
B    3
C    3
D    3
dtype: int64

## <font color='blue'>**Operaciones entre dataframes y series**</font>

Podemos operar entre un dataframe y una serie.

In [97]:
df = pd.DataFrame({"A": [3, 5, 2],
                    "B": [1, 2, 3],
                    "C": [4, 3, 4],
                    "D": [6, 3, 1]},
                   index = ["ene", "feb", "mar"])
df

     A  B  C  D
ene  3  1  4  6
feb  5  2  3  3
mar  2  3  4  1

In [98]:
s = pd.Series([2, 1, 0, 2], index = ["A", "B", "C", "D"])
s

A    2
B    1
C    0
D    2
dtype: int64

In [99]:
df + s

     A  B  C  D
ene  5  2  4  8
feb  7  3  3  5
mar  4  4  4  3

La operación se ha realizado **"row-wise"**, aplicando la suma fila por fila, tras haberse alineado el dataframe y la serie según las etiquetas del índice de columnas.

En el caso de que las columnas no sean completamente coincidentes, se rellenan los elementos desconocidos con NaN.

In [100]:
s = pd.Series([2, 1, 0, 2], index = ["A", "B", "E", "D"])
df + s

       A    B   C    D   E
ene  5.0  2.0 NaN  8.0 NaN
feb  7.0  3.0 NaN  5.0 NaN
mar  4.0  4.0 NaN  3.0 NaN

Es posible usar los métodos vistos en la sección anterior para operar también entre dataframes y series, pudiendo especificar el eje a lo largo del cual quiere realizarse la operación.

In [101]:
df = pd.DataFrame({"A": [3, 5, 2],
                    "B": [1, 2, 3],
                    "C": [4, 3, 4],
                    "D": [6, 3, 1]},
                   index = ["ene", "feb", "mar"])
df

     A  B  C  D
ene  3  1  4  6
feb  5  2  3  3
mar  2  3  4  1

In [102]:
s = pd.Series([2, 1, 0], index = ["ene", "feb", "mar"])
s

ene    2
feb    1
mar    0
dtype: int64

In [103]:
df.add(s, axis = 0)

     A  B  C  D
ene  5  3  6  8
feb  6  3  4  4
mar  2  3  4  1

## <font color='green'>**Ejercicio 2**</font>

Para cada integrante del grupo

# <font color='blue'>**Reindexación**</font>

Creación de una copia de una estructura pandas -una serie o un dataframe- en base a un nuevo índice.

# <font color='blue'>**Reindexación de series**</font>

El método básico para la reindexación de series es **pandas.Series.reindex**. Este método devuelve una copia de una serie basándose en el índice modificado de la serie original.

In [105]:
s = pd.Series([1, 2, 3, 4, 5], index = ["a", "c", "f", "g", "j"])
s

a    1
c    2
f    3
g    4
j    5
dtype: int64

Se trata de una serie cuyas etiquetas son letras no consecutivas. Es posible generar una copia reindexada de esta serie de la siguiente forma:

In [106]:
r = s.reindex(["g", "c", "a", "j", "f"])
r

g    4
c    2
a    1
j    5
f    3
dtype: int64

El primer argumento siempre es el nuevo índice. En el caso anterior se trata de una versión desordenada del índice original, por lo que la serie generada es también una versión desordenada de la original.

Si el nuevo índice es un subconjunto del original, la serie generada no contendrá todos los valores de la serie de la que se patió, tan solo los incluidos en el nuevo índice. En el siguiente ejemplo, el nuevo índice no incluye la etiqueta "a" por lo que la serie generada no incluye el valor correspondiente (1):

In [107]:
r = s.reindex(["g", "c", "j", "f"])
r

g    4
c    2
j    5
f    3
dtype: int64

Por el contrario, si en el nuevo índice se incluyen etiquetas no incluidas en el índice original, la nueva serie incluirá dicha etiqueta pero el valor asignado a ella recibe el valor por defecto NaN. En este próximo ejemplo incluimos la etiqueta "e" (no presente en el índice original) en el nuevo índice:

In [108]:
r = s.reindex(["g", "c", "e", "a", "j", "f"])
r

g    4.0
c    2.0
e    NaN
a    1.0
j    5.0
f    3.0
dtype: float64

Este valor de relleno ("NaN") es personalizable usando el parámetro **fill_value**. Si repetimos las instrucciones anteriores especificando que el valor de relleno sea, por ejemplo, 0:

In [ ]:
r = s.reindex(["g", "c", "e", "a", "j", "f"], fill_value = 0)
r

Una alternativa a fijar el valor de relleno por defecto es aplicar "lógica de relleno", rellenando los valores inexistentes con otro valor que sí exista. Tenemos tres opciones...

## <font color='blue'>**Forward fill**</font>

La primera opción consiste en rellenar los valores inexistentes "hacia adelante", haciendo que los valores existentes rellenen los valores inexistentes que los sigan. O, en otras palabras, rellenar los valores inexistentes con el primer valor existente que los precedan:

In [ ]:
s = pd.Series([1, 2, 3, 4, 5], index = ["a", "c", "f", "g", "j"])
s

In [109]:
r = s.reindex(["g", "c", "e", "a", "j", "f"], method = "ffill")
r

g    4
c    2
e    2
a    1
j    5
f    3
dtype: int64

En este caso, el valor correspondiente a la etiqueta "e" se rellena con el valor de la etiqueta anterior "c". Pero no la anterior en el nuevo índice, sino la anterior en el índice original. Veámoslos con otro ejemplo:

In [110]:
r = s.reindex(["g", "c", "m", "a", "j", "f"], method = "ffill")
r

g    4
c    2
m    5
a    1
j    5
f    3
dtype: int64

Ahora, la etiqueta nueva es "m", siendo precedida en el índice original por la "j" (si se ordenan alfabéticamente), por lo que el valor que recibe r["m"] es el que tenía r["j"]: 5.

## <font color='blue'>**Backward fill**</font>

En este otro caso, los valores inexistentes se rellenan "hacia atrás", con el primer valor existente que los siga.

In [111]:
s = pd.Series([1, 2, 3, 4, 5], index = ["a", "c", "f", "g", "j"])
s

a    1
c    2
f    3
g    4
j    5
dtype: int64

In [112]:
r = s.reindex(["g", "c", "e", "a", "j", "f"], method = "bfill")
r

g    4
c    2
e    3
a    1
j    5
f    3
dtype: int64

Nuevamente, la etiqueta no existente en el índice original es "e", y el valor que se le asigna es el correspondiente a la etiqueta que seguía a "e" en dicho índice (si se ordenan alfabéticamente): "f". Por lo tanto, se asigna a r["e"] el valor de r["f"]: 3.

## <font color='blue'>**Nearest (el más cercano)**</font>

La tercera opción asigna a cada valor desconocido el valor más próximo en la serie original. Para ver esta opción en funcionamiento necesitamos partir de una serie cuyo índice sea numérico (la operación "sustracción" en la que se basa esta tercera opción no está soportada entre cadenas de texto).

In [113]:
s = pd.Series([100, 200, 300, 400, 500], index = [10, 20, 30, 40, 50])
s

10    100
20    200
30    300
40    400
50    500
dtype: int64

Una serie cuyo índice está formado por múltiplos de 10. Generemos ahora una copia del mismo con el índice [20, 40, 19] aplicando como método de relleno "nearest".

In [114]:
r = s.reindex([20, 40, 19], method = "nearest")
r

20    200
40    400
19    200
dtype: int64

El método ha incluido el índice 19 y le ha asignado el valor del índice más próximo (20), es decir, el valor de s[20] (200).

In [115]:
r = s.reindex([20, 40, 11], method = "nearest")
r

20    200
40    400
11    100
dtype: int64

En este caso, el índice más próximo es 10, y el valor asignado es, por lo tanto, s[10]: 100.

# <font color='blue'>**Reindexación de dataframes**</font>

El método **pandas.DataFrame.reindex** ofrece una funcionalidad semejante a la disponible para series con la particularidad de que, en este caso, podemos reindexar por filas y/o por columnas. Por defecto, este método acepta una secuencia de etiquetas que determinarán qué filas se incluyen y en qué orden (es decir, por defecto la reindexación se aplica al eje 0).

In [116]:
df = pd.DataFrame(np.arange(15).reshape([5, 3]),
                  index = ["a", "b", "c", "d", "e"],
                  columns = ["A", "B", "C"])
df

    A   B   C
a   0   1   2
b   3   4   5
c   6   7   8
d   9  10  11
e  12  13  14

In [117]:
df.reindex(["d", "b"])

   A   B   C
d  9  10  11
b  3   4   5

En este ejemplo, partimos de un dataframe cuyo índice de filas tiene las etiquetas "a", "b", "c", "d" y "e", y hemos indicado como nuevo índice las etiquetas "d" y "b" (en este orden), y son estas filas (en ese orden) las que se devuelven como resultado.

Este método permite especificar las etiquetas de filas como hemos visto, pasándoselas al método como primer argumento, o con el parámetro **index**.

In [118]:
df.reindex(index = ["d", "b"])

   A   B   C
d  9  10  11
b  3   4   5

El parámetro **columns**, por su parte, permite especificar el nuevo índice de columnas:

In [119]:
df.reindex(columns = ["A", "C"])

    A   C
a   0   2
b   3   5
c   6   8
d   9  11
e  12  14

Si utilizamos ambos parámetros al mismo tiempo, imponemos simultáneamente el nuevo índice para filas y columnas.

In [120]:
df.reindex(index = ["a", "c", "f"], columns = ["A", "D", "C"])

     A   D    C
a  0.0 NaN  2.0
c  6.0 NaN  8.0
f  NaN NaN  NaN

Podemos asignar a los valores inexistentes un valor concreto usando el parámetro **fill_value**, o podemos aplicar "lógica de relleno" con el parámetro **method**, permitiéndonos rellenar los valores inexistentes hacia adelante o hacia atrás.

Y, por supuesto, si los nuevos índices contienen los mismos elementos que los índices originales pero en otro orden, el resultado del método será equivalente al original ordenado según el nuevo criterio.

In [ ]:
df.reindex(index = ["a", "c", "b", "e", "d"], columns = ["B", "C", "A"])

## <font color='blue'>**Método set_index**</font>

El método **pandas.DataFrame.set_index** fija una columna del dataframe como índice, descartando el índice existente.

In [121]:
df = pd.DataFrame({
    "año": [2016, 2017, 2018],
    "mes": ["ene", "sep", "jun"],
    "ventas": [87, 34, 112]
})
df

    año  mes  ventas
0  2016  ene      87
1  2017  sep      34
2  2018  jun     112

Vemos que se ha asignado un índice automático. Si ejecutamos el método set_index indicando como argumento el campo "mes".

In [122]:
df.set_index("mes")

      año  ventas
mes
ene  2016      87
sep  2017      34
jun  2018     112

Se fija dicha columna como índice y se elimina del conjunto de características. Aunque esta eliminación es el comportamiento por defecto, podemos controlarlo con el parámetro drop.

In [123]:
df.set_index("mes", drop = False)

      año  mes  ventas
mes
ene  2016  ene      87
sep  2017  sep      34
jun  2018  jun     112

# <font color='blue'>**Multi-indexación**</font>

Hasta ahora hemos visto series y dataframes pandas con índices sencillos, pero pueden tener también índices jerárquicos o multi-índices, lo que abre la puerta a sofisticados procesos de manipulación y análisis de datos.

Podemos imaginarnos un multi-índice como un índice en el que cada valor es una tupla única de elementos. Es posible crear estos multi-índices y extraerlos posteriormente de varias formas.

## <font color='blue'>**Creación de multi-índices**</font>

Podemos crear un multi-índice de cuatro formas distintas:

* A partir de una lista de arrays, usando el método **pd.MultiIndex.from_arrays()**
* A partir de un array de tuplas, usando el método **pd.MultiIndex.from_tuples()**
* A partir del producto cartesiano de los valores de dos iterables, usando el método **pd.MultiIndex.from_product()**
* A partir de un DataFrame, usando el método **pd.MultiIndex.from_frame()**

## <font color='blue'>**Multi-índices a partir de una lista de arrays**</font>

El primer método es aquel en el que creamos el multi-índice indicando cada una de las columnas que lo van a formar.

In [ ]:
index = pd.MultiIndex.from_arrays(
    [
        [2018, 2018, 2018, 2019, 2019, 2019],
        ["España", "Portugal", "Francia", "España", "Portugal", "Francia"]
    ],
    names = ["Año", "País"]
)
index

El parámetro **names** permite especificar los nombres de los niveles del índice jerárquico.

Al llevar este multi-índice a un dataframe se obtiene el siguiente resultado:

In [ ]:
data = pd.DataFrame(data = [18, 20, 10, 15, 12, 18], index = index, columns = ["Ventas"])
data

## <font color='blue'>**Multi-índices a partir de un array de tuplas**</font>

En este segundo método indicamos los valores del multi-índice valor por valor, siendo éstos tuplas.

In [ ]:
index = pd.MultiIndex.from_tuples(
    [
    (2018, "España"),
    (2018, "Portugal"),
    (2018, "Francia"),
    (2019, "España"),
    (2019, "Portugal"),
    (2019, "Francia")
    ],
    names = ["Año", "País"])
index

Seguimos teniendo a nuestra disposición el parámetro names para especificar los nombres de los niveles.

Si creamos nuestro DataFrame vemos que el resultado es el mismo que el que habíamos obtenido:

In [ ]:
data = pd.DataFrame(data = [18, 20, 10, 15, 12, 18], index = index, columns = ["Ventas"])
data

## <font color='blue'>**Multi-índices por producto cartesiano de arrays**</font>

El tercer método nos permite especificar los valores (únicos) de los diferentes niveles, creándose el índice jerárquico como resultado del producto escalar de los valores. Por ejemplo:

In [ ]:
index = pd.MultiIndex.from_product(
    [
        [2018, 2019],
        ["España", "Portugal", "Francia"]
    ],
    names = ["Año", "País"]
)
index

Nuevamente, el parámetro names nos permite dar nombre a los niveles.

El resultado de llevar este índice a nuestro DataFrame es el ya conocido:

In [ ]:
data = pd.DataFrame(data = [18, 20, 10, 15, 12, 18], index = index, columns = ["Ventas"])
data

## <font color='blue'>**Multi-índices a partir de un DataFrame**</font>

Por último, podemos crear el multi-índice a partir de un DataFrame en el que cada columna coincide con una columna del multi-índice.

In [ ]:
df = pd.DataFrame({
    "Año":[2018, 2018, 2018, 2019, 2019, 2019],
    "País": ["España", "Portugal", "Francia", "España", "Portugal", "Francia"]
})
df

Ahora podemos crear el índice:

In [ ]:
index = pd.MultiIndex.from_frame(df)
index

DataFrame con índice jerárquico:

In [ ]:
data = pd.DataFrame(data = [18, 20, 10, 15, 12, 18], index = index, columns = ["Ventas"])
data

## <font color='blue'>**Extracción de un nivel del índice**</font>

Trabajando con un DataFrame o una Serie pandas con multi-índice, es posible extraer los valores de un nivel del índice con el método **.get_level_values()**. El parámetro que deberemos pasar a este método será o el número del nivel o su nombre -si es que el índice ha recibido nombres-.

In [ ]:
index = pd.MultiIndex.from_product(
    [[2018, 2019],["España", "Portugal", "Francia"]],
    names = ["Año", "País"]
)
data = pd.DataFrame(data = [18, 20, 10, 15, 12, 18], index = index, columns = ["Ventas"])
data

La columna de etiquetas del multi-índice situada en el extremo izquierdo es la que recibe el número (el índice) 0. Por lo tanto:

In [ ]:
data.index.get_level_values(0)

De forma semejante:

In [ ]:
data.index.get_level_values(1)

Si pasamos como argumento el nombre de la columna del índice obtenemos resultados semejantes:

In [ ]:
data.index.get_level_values("Año")

In [ ]:
data.index.get_level_values("País")

## <font color='blue'>**Selección con multi-índices**</font>

El trabajar con estructuras pandas con multi-índices nos ofrece nuevos métodos de selección de datos.

In [ ]:
index = pd.MultiIndex.from_product(
    [[2018, 2019],["España", "Portugal", "Francia"]],
    names = ["Año", "País"]
)
data = pd.DataFrame(data = [18, 20, 10, 15, 12, 18], index = index, columns = ["Ventas"])
data

Podemos extraer las filas correspondientes al año 2018 con la siguiente expresión:

In [ ]:
data.loc[2018]

O extraer el valor del campo "Ventas" correspondiente al año 2018 y el país "España" con la siguiente expresión:

In [ ]:
data.loc[(2018, "España")]

## <font color='blue'>**Aplicación de funciones estadísticas**</font>

Usando multi-índices, también es posible aplicar funciones estadísticas al DataFrame o a la Serie especificando el nivel de la jerarquía al que aplicarlas.

In [ ]:
index = pd.MultiIndex.from_product(
    [[2018, 2019],["España", "Portugal", "Francia"]],
    names = ["Año", "País"]
)
data = pd.DataFrame(data = [18, 20, 10, 15, 12, 18], index = index, columns = ["Ventas"])
data

Podemos calcular el valor medio de las ventas, como ya sabemos con el método .mean():

In [ ]:
data.mean()

Pero si especificamos el nivel al que queremos aplicarlo, el DataFrame se agrega según los valores de dicho nivel antes de realizar la operación.

In [ ]:
data.mean(level = "Año")

O el valor medio por país:

In [ ]:
data.mean(level = "País")